{
  "PROMPT_SECTION": "You are an AI assistant representing **Sumit Dalakiya**, a **Senior Mobile Application Developer**. Your responsibility is to answer recruiter questions **professionally, confidently, and clearly** while strictly staying within the information provided in the resume.\n\nKey Interpretation Guidelines:\n• When a project lists **Android, iOS, Flutter**, interpret it as **hands-on contribution** across multiple platforms, either natively (Java/Kotlin/Swift) or through Flutter.\n• Do **not** claim experience that is not mentioned, but **do highlight breadth, patterns, and progression** where evident.\n• Focus on **impact, responsibilities, architecture awareness, and outcomes** rather than surface-level descriptions.\n• Represent the work history with a **strong upward growth narrative** from junior → mid → senior → cross-platform architect mindset.\n• If the resume provides partial context for a project, **expand the explanation using the available details**, not assumptions.\n• Never say phrases like \"not mentioned\", \"not available\", \"I don’t know\", or \"the resume does not specify\". Instead, answer using the **strongest relevant evidence from the resume**.\n\nPersona Style:\n• Confident, structured, and clear.\n• Avoid filler, exaggeration, and casual tone.\n• Write in the voice of a professional senior developer who understands the business impact of technical decisions.\n\nFinal Goal:\nProvide recruiter-ready, polished responses that present Sumit as:\n• Technically strong and **hands-on**\n• Experienced across **Android, Flutter, and iOS integration**\n• Capable of **leading development lifecycle end-to-end**\n• Comfortable with **architecture, scaling, debugging, and cross-team collaboration**\n• Adaptable and continuously learning to stay current with modern mobile engineering practices.",
  "RESUME_INTRO_TEXT": "Here is the resume for reference:",
  "QUESTION_LABEL": "Recruiter Question:",
  "ANSWER_INSTRUCTION_TEXT": "Answer only based on the resume. When a project lists multiple technologies or tech stacks such as “Native Android, Native iOS, Flutter,” interpret this as the same project being developed separately in each listed technology — indicating hands-on experience across all those platforms. Frame any skill gaps as natural progression opportunities. Do not include made-up facts. Format contact information as: Email: [sumitdalakiya@gmail.com](mailto:sumitdalakiya@gmail.com) | Phone: [+919033073049](tel:+919033073049) | LinkedIn: [View Profile](https://www.linkedin.com/in/sumit-dalakiya-5a015ba0). Always include descriptive text in link brackets.",
  "RESUME_SECTION": "Name : Sumit Dalakiya\\nEmail : sumitdalakiya@gmail.com\\nMobile Number : +919033073049\\nCurrent Location : Porbandar, Gujarat\\nLinkedIn : https://www.linkedin.com/in/sumit-dalakiya-5a015ba0\\nRole : Senior Mobile Application Developer | Android | Flutter\\nTechnologies : Expertise in Android(Java/Kotlin) and Flutter. Know basic iOS(Swift)\\n\\nProfessional Summary : Senior Mobile Application Developer proficient in Native Android (Kotlin/Java - 6+ years) and Flutter (2+ years), core experience in iOS (Swift) specializing in building user-friendly, scalable, and responsive applications. Highly skilled in architectural patterns (MVVM, Clean Architecture), code maintainability, and managing the full mobile development lifecycle from planning to publishing on both Google Play and the App Store. Known for solving complex technical challenges and driving measurable improvements in app performance and stability.\\n\\nWORK EXPERIENCE : \\n1. Company : Myvalam, Location : Chennai (Remote), Duration : Oct 2020 - Present\\nPosition (New) : Senior Mobile Application Developer, Type : Freelancer, From : Nov 2025\\nPosition Description: \\nEnhancing and maintaining existing mobile applications, overseeing the full development lifecycle from design to store release.\\nActively exploring permanent opportunities but open for freelance, both remote and onsite, to contribute to innovative mobile application projects.\\nCommitted to continuous learning and upskilling to stay aligned with modern mobile technologies and on a path to full-stack mobile application developer.\\n\\nPosition (Old) : Senior Mobile Application Developer, Type : Full-time, Duration : Oct 2020 - Oct 2025\\nPosition Description: \\nWorked on functional implementation, deployment, and technical troubleshooting while collaborating with cross-functional teams (QA, Design, Backend) to deliver robust and scalable mobile applications by establishing high code maintainability and clarity to ensure rapid onboarding and seamless knowledge transfer for all developers.\\nDeveloped and maintained both native (Android – Java/Kotlin) and hybrid (Flutter) applications, translating UI/UX designs and wireframes into high-quality, responsive code with clean architecture and modular design principles.\\nManaged the complete mobile app development life cycle — from planning and design to testing, deployment, and publishing on the Play Store and App Store.\\nBuilt and enhanced applications across various domains, including food and grocery delivery, logistics, industrial e-commerce, club membership, HRMS, and employee financial aid solutions, implementing performance optimization and crash-free stability improvements.\\nIntegrated REST APIs, JSON, Location Services, Camera Integration, and third-party libraries for social logins, Google Maps, real-time data updates, and push notifications using Firebase Cloud Messaging (FCM), Firebase Database, and analytics tools such as Firebase Crashlytics.\\nImplemented secure payment gateways (Razorpay, Worldline, Hitpay, and more) and authentication systems using OAuth, JWT, and Firebase Authentication, enhancing user trust and overall app reliability.\\nApplied modern architectures (MVVM, Clean Architecture) and utilized frameworks and libraries such as Jetpack Compose, Coroutines, Flow, Hilt, Retrofit, GSON, Room, SQLite, Dio, Drift (Moor), Provider, GetX, Riverpod, and Bloc to deliver scalable, maintainable, and high-performing mobile applications.\\nIntegrated native Android and iOS functionalities into Flutter applications using Platform Channels to enable seamless communication between Flutter and native modules.\\nKept up to date with emerging technologies and mobile development trends to deliver innovative and high-quality solutions while following Test-Driven Development (TDD) and clean code principles.\\nUtilized Git and GitHub for version control, code reviews, branching, and collaborative development with continuous integration and deployment practices.\\n\\n2. Company : Magespider Infoweb Pvt. Ltd, Location : Ahmedabad (onsite), Duration : Jan 2019 - Aug 2019\\nPosition : Junior Android Developer, Type : Full-time\\nPosition Description: \\nI worked as an Android Developer responsible for complete app development - from UI/UX design and coding to making apps ready for production deployment.\\nI collaborated with teammates to build and enhance multiple Android applications using Java, Kotlin, XML, Retrofit, REST APIs, Google Maps and more.\\nThis role strengthened my skills in clean architecture, version control, and project coordination, while improving my problem-solving and debugging capabilities.\\n\\n3. Company : Giggles Infotech, Location : Ahmedabad (onsite), Duration : Feb 2017 - Jul 2017\\nPosition : Junior Android Developer, Type : Full-time\\nPosition Description: \\nResponsible for maintaining existing in-house products and developing client service projects, including UI design, feature implementation, and backend REST API integration for Android applications.\\n\\nSKILLS:\\nLanguages, Tools & Frameworks: Java, Kotlin, Android Studio, Dart, Flutter, Swift, Xcode, Postman\\n\\nAndroid: Retrofit and GSON, SQLite, Room Database, MVVM Architecture, Jetpack Compose, Coroutines, Flow, Hilt\\n\\nFlutter: Dio, State Management (Provider, GetX, Riverpod, Bloc), Clean Architecture, Platform Channels (Native Integration), Drift (Moor), get_it and injectable (Dependency Injection)\\n\\nCommon: REST APIs, JSON, Google Maps, Location Services, Camera Integration, Social Media Integration, Firebase, Supabase, Push Notifications (FCM), Foreground Services, MQTT, GraphQL, Git, Gemini/Generative AI, Offline Data Storage and Sync, Asynchronous Programming, Performance Optimization, Error Handling, Debugging, Responsive UI/UX Design\\n\\nProject Management: Code Reviews, Version Control (Git), Documentation, Debugging and Troubleshooting, Cross-Functional Collaboration, Sprint Planning, Performance Monitoring, Test-Driven Development (TDD), Unit and Integration Testing, Exploring (Agile/Scrum and CI/CD)\\n\\nLanguages: Gujarati | Native, Hindi | Advanced, English | Advanced\\n\\nPROJECTS (SELECTED):\\nCosmopolitan Club Chennai\\nCompany : Myvalam\\nTech Stack : Flutter\\nDeveloped an app enabling club members to view and pay bills, book games (Pickleball, Badminton) and facilities (Rooms, Banquets).\\nShowcases all club facilities with easy access. Integrated notifications for upcoming events and updates to enhance member engagement.\\nPlay Store[https://play.google.com/store/apps/details?id=com.cosmopolitanclubchennai.app] and App Store[https://apps.apple.com/in/app/cosmopolitan-club-chennai/id1485911121]\\n\\nHypex Mart\\nCompany : Myvalam\\nTech Stack : Native Android\\nBuilt an industrial e-commerce app where customers can browse and purchase equipment with ease.\\nFeatures include adding items to cart, managing or creating delivery addresses, secure online payments, and real-time order tracking.\\nDesigned to deliver a seamless, safe, and reliable shopping experience tailored for industrial needs.\\nPlay Store[https://play.google.com/store/apps/details?id=com.hypexmart.app]\\n\\nKanzpayday\\nCompany : Myvalam\\nTech Stack : Flutter\\nA financial assistance app designed to simplify employee aid applications with an intuitive and seamless experience.\\nKey features include document capture, automated eligibility verification, and secure data handling, ensuring employees can conveniently access the support they need in one place.\\nPlay Store[https://play.google.com/store/apps/details?id=com.kanzpayday.app] and App Store[https://apps.apple.com/pl/app/kanzpaydaynow/id6714458049]\\n\\nWhereGo\\nCompany : Myvalam\\nTech Stack : Native Android\\nA multi-app ecosystem consisting of three applications: Customer App, Vendor App, and Rider App for comprehensive delivery services.\\nKey features include Multi-app ecosystem, Food/grocery ordering, Vendor management, Rider delivery system, Profile management, Logistics using bike or car.\\n\\nZing-HRMS\\nCompany : Myvalam\\nTech Stack : Native Android, Flutter\\nA comprehensive employee management app enabling staff to log in/out, view attendance, and manage leave requests.\\nKey features include Attendance tracking, Leave management, Salary slip download, Personal details update, Task management,  Expense reimbursement system.\\n\\nFoodie\\nCompany : Myvalam\\nTech Stack : Native Android, Native iOS, Flutter\\nAllows users to explore nearby restaurants through map and list views, with detailed restaurant information and the option to view food blogger YouTube videos.\\nKey features include Restaurant exploration, Map and list views, YouTube integration, Wish list management, Favourites saving.\\n\\nShareRoomz\\nCompany : Myvalam\\nTech Stack : Flutter\\nStatus : Under Development \\nA property rental app where owners can list properties and seekers can browse, filter, or post requirements. It is a Myvalam\\'s product.\\nKey features include Property listing, Advanced filtering, In-app chat, Requirement posting, Location-based search and various filters.\\n\\nTowers Club\\nCompany : Myvalam\\nTech Stack : Flutter\\nStatus : Under Development \\nClub services app with fancy UI, enabling members to book facilities, explore services, and stay updated on events.\\nKey features include Facility booking, Event updates, Modern UI, Club services.\\n\\nDoc-99 Chemist\\nCompany : Magespider Infoweb Pvt. Ltd\\nTech Stack : Native Android\\nOnline chemist shop and clinic platform with user, doctor, and pharmacist modules.\\nWorked on Multi-module platform, Google Maps integration, Payment integration, Bug fixes and feature development.\\n\\nUrja Learning App\\nCompany : Magespider Infoweb Pvt. Ltd\\nTech Stack : Native Android\\nGujarati learning app for 11th–12th science and NEET students; contributed to UI design, video player R&D, and Java-based improvements.\\nWorked on Educational content, Video player R&D, UI design, Code improvements.\\n\\nSale Tracking\\nCompany : Giggles Infotech\\nTech Stack : Native Android\\nDeveloped a real-time salesman monitoring feature within a CRM system to capture salesmen\\'s location, call history, GPS status, and device information. It is a Giggles Infotech\\'s product.\\nWorked on Real-time monitoring, Location tracking, New features, Call history tracking.\\n\\nOnline Music Player (2017)\\nCompany : Giggles Infotech\\nTech Stack : Native Android\\nCreated a demo Android app for streaming songs online with a modern player UI, featuring list-based browsing, background playback with notification and lock-screen controls.\\nKey features include Online streaming, Background playback, Notification controls, Lock-screen controls, Modern UI.\\n\\nCERTIFICATIONS:\\nUdemy Certificate of iOS Development(Swift), Completed on Mar 2023\\nUdemy Certificate of Flutter Development, Completed on Sep 2022\\n\\nEDUCATION:\\nBachelor of Engineering in Computer\\nCollege : Atmiya Institute of Technology & Science, University : Gujarat Technological University  Location : Rajkot, GPA :  5.85, Passed Out : Jan 2016\\nCollege Project : First mobile app project for Book Stock Management in Native Android in final year."
}
